print('''
Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. .Снизу шляпка затянута … плёнкой. Когда её уберёшь, 
откроется нижняя … сторона шляпк.. .
''')
a = input("Введите недостающее первое слово: покрытая … ")
b = input("Введите недостающую первую букву: кожиц..й:")
a1 = input("Введите недостающее второе словo: держится на … ")
b1 = input("Введите недостающую вторую букву: ножк..:")
a2 = input("Введите недостающее третье слово: затянута … ")
a3 = input("Введите недостающее четвертое слово: нижняя … ")
b2 = input("Введите недостающую третью букву: шляпк..:")
print(f'Шляпка гриба, покрытая {a} кожиц{b}й, держится на {a1} ножк{b1}. Снизу шляпка затянута {a2} плёнкой. Когда её уберёшь, \nоткроется нижняя {a3} сторона шляпк{b2}')




