# 'строка-разделитель'.join(перечисляемый_объект)
# всегда возвращает строку, т.к. join - метод класса str

glasnie = ['а', 'у', 'о', 'и', 'э', 'ы', 'я', 'ю', 'е', 'ё']
glasnie_str = "--".join(glasnie)
print("Строка гласных:", glasnie_str)


#-----------------------------------------

# Команды для изменения регистра

s = 'hEllo wOrLd'
su = s.upper()
sl = s.lower()

print(s)
print(su)
print(sl)

#-----------------------------------------
# sum() - возвращает сумму элементов последовательности
# iterable - перечисляемый объект
# init_value - начальное значение сумматора

values = [43, 77, -11, 576, 665, -34, -1275]

print('sum:', sum(values))
print('-41 + sum:', sum(values, -41))


